module.exports = [
	{
		id: '2.1.19092x',
		content: `该版本为2.0版第二个发布版本，更新内容如下：
				  1. 修复部分选手因授权失效导致头像无法显示的问题，现在程序会提示这些选手重新进行授权
				  2. 修复PK赛结果显示页面中先手显示有时会出现错误的问题
				  3. 选手的个人页面中现在也能分享已经解锁的成就了，快来试试吧~
				  4. 完善版本管理机制`
	},
	{
		id: '2.0.190917',
		content: `赛事中心2.0版正式上线啦！~该版本为个人PK赛加入了大量新机制，包括：
				  1. 新增成就系统，目前加入了21种常规成就和3种隐藏成就
				  2. 新增持续性效果机制，在此基础上，许多熟悉的道具又回来啦
				  3. 新增当前赛季的选手数据统计和成就展示页面，可以通过在PK赛首页点击相应选手条目进入查看
				  4. 道具商店新增【兑换纪录】
				  5. 新增系统通知，在进入PK赛首页时若有新成就或升段会自动以弹出框形式显示
				  6. 重新设计了PK赛局况登记页面，现在可以显示更多选手信息了
				  7. 机制更改：常规赛/友谊赛不再需要裁判审核，但仍需要分享到微信群公示。定级赛仍需要指定裁判，并由裁判确认后生效。
				  8. 修复了一些小bug
				  已知Bug：
				  1. 测试中发现ios系统进入PK赛首页时有一定概率无法正常获取和显示段位表/比赛历史/周榜单信息。需返回上一页重新进入后可恢复正常。`
	},
	{
		id: '1.4.190408',
		content: `该版本为第五个发布版本，更新内容如下：
				  1. 界面优化：调整首页布局，修复Android机型下的阴影不显示的问题，为段位添加图标使其更容易分辨
				  2. “历史战绩”调整为“赛况历史”，可以查看所有选手比赛的历史记录
				  3. 新增“每周榜单”，可以查看每周的场高分榜、局高分榜和分屏榜
				  4. 修复了比赛录入页面输入完最后一格时看不到提交按钮的问题`
	},
	{
		id: '1.3.190404',
		content: `该版本为第四个发布版本，更新内容如下：
				  1. 修复启动时检查应用更新导致持续显示加载中的问题
				  2. 优化首页和PK赛主页的界面风格（UI设计 by 小白）`
	},
	{
		id: '1.2.190402',
		content: `该版本为第三个发布版本，更新内容如下：
				  1. 启动时自动检查并应用更新
				  2. 现在可以放弃未完成录入的比赛了
				  3. 道具商城正式开启，可以在PK赛首页中进入商城兑换道具`
	},
	{
		id: '1.1.190311',
		content: `该版本为第二个发布版本，更新内容如下：
				  1. 登记PK赛的常规赛/友谊赛，并相应计算比赛结果（段位变化、积分变化）
				  2. PK赛的常规赛/友谊赛结果查看以及确认操作
				  3. 优化部分页面逻辑和提示信息`
	},
	{
		id: '1.0.190306',
		content: `该版本为第一个发布版本，实现了以下功能：
				  1. 账号注册与绑定；
				  2. 密码修改；
				  3. 2019年春季PK赛首页内容；
				  4. 通过定级赛或段位继承方式加入2019年春季PK赛；
				  5. 定级赛结果展示页面；
				  6. 裁判查看相关比赛并进行确认操作。`
	}
];