module.exports = [
	{
		id: '1.3.190404',
		content: `该版本为第四个发布版本，更新内容如下：
				  1. 修复启动时检查应用更新导致持续显示加载中的问题
				  2. 优化首页和PK赛主页的界面风格（UI设计 by 小白）`
	},
	{
		id: '1.2.190402',
		content: `该版本为第三个发布版本，更新内容如下：
				  1. 启动时自动检查并应用更新
				  2. 现在可以放弃未完成录入的比赛了
				  3. 道具商城正式开启，可以在PK赛首页中进入商城兑换道具`
	},
	{
		id: '1.1.190311',
		content: `该版本为第二个发布版本，更新内容如下：
				  1. 登记PK赛的常规赛/友谊赛，并相应计算比赛结果（段位变化、积分变化）
				  2. PK赛的常规赛/友谊赛结果查看以及确认操作
				  3. 优化部分页面逻辑和提示信息`
	},
	{
		id: '1.0.190306',
		content: `该版本为第一个发布版本，实现了以下功能：
				  1. 账号注册与绑定；
				  2. 密码修改；
				  3. 2019年春季PK赛首页内容；
				  4. 通过定级赛或段位继承方式加入2019年春季PK赛；
				  5. 定级赛结果展示页面；
				  6. 裁判查看相关比赛并进行确认操作。`
	}
];